IDEA Open Model
DappedEnd.GeomId Property
Compatible with IDEA StatiCa v 10.1
 Id representing geometrical parts of Detail
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public int GeomId { get; set; }
Public Property GeomId As Integer
	Get
	Set
public:
property int GeomId {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
DappedEnd Class
IdeaRS.OpenModel.Detail Namespace